---
type: MathComparisonUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# MathComparisonUtils

`Autodesk.Revit.DB.MathComparisonUtils` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsAlmostEqual | 2021 | `public static bool IsAlmostEqual ( double value1 , double value2 )` |
| Method | IsAlmostZero | 2021 | `public static bool IsAlmostZero ( double value )` |
| Method | IsGreaterThan | 2021 | `public static bool IsGreaterThan ( double value1 , double value2 )` |
| Method | IsGreaterThanOrAlmostEqual | 2021 | `public static bool IsGreaterThanOrAlmostEqual ( double value1 , double value2 )` |
| Method | IsLessThan | 2021 | `public static bool IsLessThan ( double value1 , double value2 )` |
| Method | IsLessThanOrAlmostEqual | 2021 | `public static bool IsLessThanOrAlmostEqual ( double value1 , double value2 )` |